package base;

public class Data {
	// 二维数组样本属性值及其所属分类（数组中的最后一个元素为样本所属分类,1为是，0为否）
	private String[][] datas = new String[][] {
			{ "色泽", "根蒂", "敲声", "纹理", "脐部", "触感", "结果" },
			{ "青绿", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", "1" },
			{ "乌黑", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑", "1" },
			{ "乌黑", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", "1" },
			{ "青绿", "蜷缩", "沉闷", "清晰", "凹陷", "硬滑", "1" },
			{ "浅白", "蜷缩", "浊响", "清晰", "凹陷", "硬滑", "1" },
			{ "青绿", "稍蜷", "浊响", "清晰", "稍凹", "软粘", "1" },
			{ "乌黑", "稍蜷", "浊响", "稍糊", "稍凹", "软粘", "1" },
			{ "乌黑", "稍蜷", "浊响", "清晰", "稍凹", "硬滑", "1" },
			{ "乌黑", "稍蜷", "沉闷", "稍糊", "稍凹", "硬滑", "0" },
			{ "青绿", "硬挺", "清脆", "清晰", "平坦", "软粘", "0" },
			{ "浅白", "硬挺", "清脆", "模糊", "平坦", "硬滑", "0" },
			{ "浅白", "蜷缩", "浊响", "模糊", "平坦", "软粘", "0" },
			{ "青绿", "稍蜷", "浊响", "稍糊", "凹陷", "硬滑", "0" },
			{ "浅白", "稍蜷", "沉闷", "稍糊", "凹陷", "硬滑", "0" },
			{ "乌黑", "稍蜷", "浊响", "清晰", "稍凹", "软粘", "0" },
			{ "浅白", "蜷缩", "浊响", "模糊", "平坦", "硬滑", "0" },
			{ "青绿", "蜷缩", "沉闷", "稍糊", "稍凹", "硬滑", "0" } };
	
	private String[][] data = new String[][] {
			{"色泽","敲声","脐部","触感","结果"},
			{"青绿","浊响","稍凹","软粘","1"},
			{"乌黑","浊响","稍凹","硬滑","1"},
			{"乌黑","浊响","稍凹","软粘","0"}};

	// get()和set()函数
	
	//输入行列数，返回对应的值
	public String getValue(int i,int j){
		return datas[i][j];
	}
	
	public String[][] getDatas(){
		return datas;
	}
	
	//循环遍历整个二维数组
	public void showData(String[][] D){
		for(int i=0;i<D.length;i++){
			for(int j=0;j<D[0].length;j++){
				System.out.print(D[i][j]+"  ");
			}
			System.out.println("");
		}
	}
	public static void main(String[] args){
		Data data = new Data();
		data.showData(data.getDatas());
	}

	public String[][] getData() {
		return data;
	}

	public void setData(String[][] data) {
		this.data = data;
	}
	
}
